var relearn_searchindex = [
  {
    "breadcrumb": "从零开始学习这个世界",
    "content": "中学数学自学材料新编",
    "description": "中学数学自学材料新编",
    "tags": [],
    "title": "悟数学",
    "uri": "/maths/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界",
    "content": "中小学语文教学材料新编",
    "description": "中小学语文教学材料新编",
    "tags": [],
    "title": "真语文",
    "uri": "/wen/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界",
    "content": "",
    "description": "",
    "tags": [],
    "title": "类别",
    "uri": "/categories/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界",
    "content": "",
    "description": "",
    "tags": [],
    "title": "标签",
    "uri": "/tags/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  标签",
    "content": "",
    "description": "",
    "tags": [],
    "title": "标签 :: 初中",
    "uri": "/tags/%E5%88%9D%E4%B8%AD/index.html"
  },
  {
    "breadcrumb": "",
    "content": "一个中小学教育推倒重来的平行世界里的狂想",
    "description": "嗷嗷嗷嗷",
    "tags": [],
    "title": "从零开始学习这个世界",
    "uri": "/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  标签",
    "content": "",
    "description": "",
    "tags": [],
    "title": "标签 :: 几何",
    "uri": "/tags/%E5%87%A0%E4%BD%95/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  类别",
    "content": "",
    "description": "",
    "tags": [],
    "title": "类别 :: 教育方法论",
    "uri": "/categories/%E6%95%99%E8%82%B2%E6%96%B9%E6%B3%95%E8%AE%BA/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  标签",
    "content": "",
    "description": "",
    "tags": [],
    "title": "标签 :: 教育方法论",
    "uri": "/tags/%E6%95%99%E8%82%B2%E6%96%B9%E6%B3%95%E8%AE%BA/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  悟数学",
    "content": "这一篇来讨论初中几何的学习。当前主流初中教学中，几何与代数的共同点就是“代数”。有人会说，几何怎么也是代数了呢？这要从古希腊的《几何原本》说起。\n很多人以为《几何原本》的公理体系是处理平面图形的，其实不然。《几何原本》处理的其实是代数。那么，几何到底是怎么“代数”的呢？几何的“代数”体现在长度和面积上，即如何从单位的长度，导出数量的关系。如果某个几何关系对任意长度成立，就等价于说一个代数关系对正实数成立。实际的教学实践中，大量的初中几何题，本质仍然是处理长度和面积的等价关系、倍数关系，仍然是“代数”。\n既然几何的本意是代数，那么初中几何需要学习什么呢？\n当前主流的几何学习，往往陷入两个大坑。一个是强求《几何原本》的公理推演体系，和尺规作图搞在一起，沉湎在繁复而又枯燥无味的理论推导中。另一个是做题体系，不断开拓各种奇怪的几何构型，沉沦在各种辅助线、变换、折叠、对称里面。这两个大坑都是初中生学习数学时陷入迷茫和恐惧的主要推手。初中学生在面对这两个大坑时，心里有一个问题：\n我学这些有什么用？\n这并不是一个逃避学习的借口。这个问题是切实存在的。背后的原因是数学和社会关系的折射。\n数学是从实用中来的，也必然到实用中去。然而，随着时代的进步，社会需要的实用的数学也在不断进步。初中数学的几何知识，对应的是一两千年前的社会生产水平。现在的社会生产里需要的数学，已经不再是初中的平面几何了。所以，初中的平面几何内容已经脱节于时代了。但是，初中几何又是现代数学的基础。所以，我们要做的事情，不是专研初中级别的初等几何，而是从现代社会所需的数学出发，用现代社会所需的数学知识来反推初等几何的教学作用。\n一旦从这个角度出发，我们对初中的初等几何的教学目标就立刻清晰了。初中的初等几何，一个目标是引入解析几何所需的坐标系、方程，为分析学和线性代数打下基础。另一个目标是引入对称性的概念，为变换群的概念给出启蒙。其他的内容，都是附加的。\n附加的内容有哪些呢？一个是逻辑推理，一个是美育。逻辑推理是数学活动的核心。公理体系以及在其基础上的演绎推理是运用逻辑推理的典范。所以，公理体系以及几何证明是不可少的。此外，几何也是体现数学的美的经典场所。我们要用几何来向学习者展现数学的美、理性的美，让学习者面对数学的复杂性产生兴趣而不是恐惧。\n因此，我们的几何入门是这样布置的：\n从公理体系出发，从公设、公理到证明，不遗漏任何细节。向学习者完整展现体系化脉络化的逻辑推理。 不讲尺规作图，降低难度。 同步学习基本的形式逻辑，包括反证法。反证法是几何证明的重要工具。 到三角心的五心和九点圆即结束。不陷入各种几何构型的题海。 尽早引入坐标系，讨论对称性、几何变换，尽早引入三角函数，尽早引入向量。在向量的层面，重新向代数靠拢。这时的学习者已经对开方、无理数、代数式的运算有了一定的认识，可以比较轻松地讨论向量的计算。 对于学习者来说，学习几何的方法如下：\n把命题的证明作为范文来学习，理解各种证明方法。 在命题的证明中理解充分条件和必要条件、逆命题、否命题、换质法、换位法等概念，熟悉逻辑推理的方法，熟悉反证法。 三角形、圆作为经典构型重点理解。这两个概念又可以引出三角函数的概念。 理解坐标系。把坐标系作为工具，理解平面形的变换。 在坐标系的基础上，理解向量的动机。通过形式逻辑和三角函数的积累，理解向量。 坐标系对应着高中的实变函数曲线分析，向量对应着高中的线性代数，三角函数对应着高中的复数和级数。这样，初中和高中的学习就衔接上了。\n很多人把初中几何看成一把梯子，爬起来战战兢兢。我们要让初中几何成为刻骨铭心的初恋，虽然痛苦，但又那么让人怀念。",
    "description": "这一篇来讨论初中几何的学习。当前主流初中教学中，几何与代数的共同点就是“代数”。有人会说，几何怎么也是代数了呢？这要从古希腊的《几何原本》说起。\n很多人以为《几何原本》的公理体系是处理平面图形的，其实不然。《几何原本》处理的其实是代数。那么，几何到底是怎么“代数”的呢？几何的“代数”体现在长度和面积上，即如何从单位的长度，导出数量的关系。如果某个几何关系对任意长度成立，就等价于说一个代数关系对正实数成立。实际的教学实践中，大量的初中几何题，本质仍然是处理长度和面积的等价关系、倍数关系，仍然是“代数”。\n既然几何的本意是代数，那么初中几何需要学习什么呢？\n当前主流的几何学习，往往陷入两个大坑。一个是强求《几何原本》的公理推演体系，和尺规作图搞在一起，沉湎在繁复而又枯燥无味的理论推导中。另一个是做题体系，不断开拓各种奇怪的几何构型，沉沦在各种辅助线、变换、折叠、对称里面。这两个大坑都是初中生学习数学时陷入迷茫和恐惧的主要推手。初中学生在面对这两个大坑时，心里有一个问题：\n我学这些有什么用？\n这并不是一个逃避学习的借口。这个问题是切实存在的。背后的原因是数学和社会关系的折射。\n数学是从实用中来的，也必然到实用中去。然而，随着时代的进步，社会需要的实用的数学也在不断进步。初中数学的几何知识，对应的是一两千年前的社会生产水平。现在的社会生产里需要的数学，已经不再是初中的平面几何了。所以，初中的平面几何内容已经脱节于时代了。但是，初中几何又是现代数学的基础。所以，我们要做的事情，不是专研初中级别的初等几何，而是从现代社会所需的数学出发，用现代社会所需的数学知识来反推初等几何的教学作用。\n一旦从这个角度出发，我们对初中的初等几何的教学目标就立刻清晰了。初中的初等几何，一个目标是引入解析几何所需的坐标系、方程，为分析学和线性代数打下基础。另一个目标是引入对称性的概念，为变换群的概念给出启蒙。其他的内容，都是附加的。\n附加的内容有哪些呢？一个是逻辑推理，一个是美育。逻辑推理是数学活动的核心。公理体系以及在其基础上的演绎推理是运用逻辑推理的典范。所以，公理体系以及几何证明是不可少的。此外，几何也是体现数学的美的经典场所。我们要用几何来向学习者展现数学的美、理性的美，让学习者面对数学的复杂性产生兴趣而不是恐惧。\n因此，我们的几何入门是这样布置的：\n从公理体系出发，从公设、公理到证明，不遗漏任何细节。向学习者完整展现体系化脉络化的逻辑推理。 不讲尺规作图，降低难度。 同步学习基本的形式逻辑，包括反证法。反证法是几何证明的重要工具。 到三角心的五心和九点圆即结束。不陷入各种几何构型的题海。 尽早引入坐标系，讨论对称性、几何变换，尽早引入三角函数，尽早引入向量。在向量的层面，重新向代数靠拢。这时的学习者已经对开方、无理数、代数式的运算有了一定的认识，可以比较轻松地讨论向量的计算。 对于学习者来说，学习几何的方法如下：\n把命题的证明作为范文来学习，理解各种证明方法。 在命题的证明中理解充分条件和必要条件、逆命题、否命题、换质法、换位法等概念，熟悉逻辑推理的方法，熟悉反证法。 三角形、圆作为经典构型重点理解。这两个概念又可以引出三角函数的概念。 理解坐标系。把坐标系作为工具，理解平面形的变换。 在坐标系的基础上，理解向量的动机。通过形式逻辑和三角函数的积累，理解向量。 坐标系对应着高中的实变函数曲线分析，向量对应着高中的线性代数，三角函数对应着高中的复数和级数。这样，初中和高中的学习就衔接上了。\n很多人把初中几何看成一把梯子，爬起来战战兢兢。我们要让初中几何成为刻骨铭心的初恋，虽然痛苦，但又那么让人怀念。",
    "tags": [
      "教育方法论",
      "几何",
      "初中",
      "数学"
    ],
    "title": "平面几何教学探索之一：到底要学什么？",
    "uri": "/maths/euclid-1/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  类别",
    "content": "",
    "description": "",
    "tags": [],
    "title": "类别 :: 平面几何学习",
    "uri": "/categories/%E5%B9%B3%E9%9D%A2%E5%87%A0%E4%BD%95%E5%AD%A6%E4%B9%A0/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  标签",
    "content": "",
    "description": "",
    "tags": [],
    "title": "标签 :: 数学",
    "uri": "/tags/%E6%95%B0%E5%AD%A6/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界 \u003e  悟数学",
    "content": "首先记录一下这个项目的缘由。\n针对当前中学数学教材对自学者不友好，主流教辅、补习机构以题为纲，过于应试，过于碎片化的现状，我在大约2020年底萌发了整理中学数学乃至大学本科数学的中文自学材料的念头。而激发我实际行动的有几个具体的点。\n第一个是在网上看到的一个关于中学数学课本改革的讨论，里面提到中学数学一直以来削弱集合、映射、逻辑等必要概念的趋势。\n第二个是读到了张景中《不用极限的微积分》这本书，其致力于用绕过极限的方法给中学生讲微积分。为什么要绕过极限呢？因为$\\epsilon - \\delta$语言太抽象太难了，中学生不理解。而我想：这东西真的这么难吗？\n第三个是关于初中平面几何学习的讨论。初中平面几何到底在教什么？目标又是什么？为什么到了高中反而又不重视了？这也是引发我对中学数学教育整体思考的一个点。\n思考的结果就是《悟数学》。《悟数学》是一个致力于重建中文数学自学体系的项目。它的主要目标是打通自学者接触高等数学的大门，让只有小学数学基础的人也能顺利自学完中学知识，扫除学习分析学、线性代数、拓扑学、概率论等知识的障碍。\n《悟数学》的出发点有这么几个：\n仿课本形制，大致对应初中和高中的教材编排方式。初中六册，高中六册。 从初高中整体考虑，把\\(\\epsilon - \\delta\\)语言嵌入中学数学教育，让中学生理解极限乃至微积分。 给出一个初中平面几何学习的解决方案，即从“为什么学”、“学什么”到“怎么学”、“学完可以干什么”，全部理清，给出一个回答。 这个是顺带的：对人名化、欧化的现代数学术语做一点小小的反抗。大佬们做学术很忙，为了效率，都用英文，对学术和术语的中文化并不太上心。而且说句不好听的，很多大佬的中文水平并不怎么出色，并不是很好的翻译。反正到了做学术的时候都不用中文了，那么就容许我在教育的领域，拾起大佬们放弃的中文，自娱自乐一下。 《悟数学》这个项目大概在2021年开始，作为自娱自乐的玩意开工。过程中有很多困难，也有很多感悟和收获。做完了初中部分，我发现，从数学的角度出发，很多关于逻辑的内容，并不适合放在数学科目里（或者说我能力有限）。但这些内容对于理性思考乃至理解更多的数学内容，又是很必要的。而以当前的语文教育方式，学生恐怕不会在语文课上系统学习这些内容。因此又激发出了关于中小学语文的教育和教学材料的一些思考。这些思考的结果是另一个项目。当然，由于能力有限，语文相关的项目还处于堆积材料的程度。\n总之，这一切只是对当前教育现状的吐槽和不切实际的狂想。请作为一个类似幻想小说的设定的东西来看待。",
    "description": "首先记录一下这个项目的缘由。\n针对当前中学数学教材对自学者不友好，主流教辅、补习机构以题为纲，过于应试，过于碎片化的现状，我在大约2020年底萌发了整理中学数学乃至大学本科数学的中文自学材料的念头。而激发我实际行动的有几个具体的点。\n第一个是在网上看到的一个关于中学数学课本改革的讨论，里面提到中学数学一直以来削弱集合、映射、逻辑等必要概念的趋势。\n第二个是读到了张景中《不用极限的微积分》这本书，其致力于用绕过极限的方法给中学生讲微积分。为什么要绕过极限呢？因为$\\epsilon - \\delta$语言太抽象太难了，中学生不理解。而我想：这东西真的这么难吗？\n第三个是关于初中平面几何学习的讨论。初中平面几何到底在教什么？目标又是什么？为什么到了高中反而又不重视了？这也是引发我对中学数学教育整体思考的一个点。\n思考的结果就是《悟数学》。《悟数学》是一个致力于重建中文数学自学体系的项目。它的主要目标是打通自学者接触高等数学的大门，让只有小学数学基础的人也能顺利自学完中学知识，扫除学习分析学、线性代数、拓扑学、概率论等知识的障碍。\n《悟数学》的出发点有这么几个：\n仿课本形制，大致对应初中和高中的教材编排方式。初中六册，高中六册。 从初高中整体考虑，把\\(\\epsilon - \\delta\\)语言嵌入中学数学教育，让中学生理解极限乃至微积分。 给出一个初中平面几何学习的解决方案，即从“为什么学”、“学什么”到“怎么学”、“学完可以干什么”，全部理清，给出一个回答。 这个是顺带的：对人名化、欧化的现代数学术语做一点小小的反抗。大佬们做学术很忙，为了效率，都用英文，对学术和术语的中文化并不太上心。而且说句不好听的，很多大佬的中文水平并不怎么出色，并不是很好的翻译。反正到了做学术的时候都不用中文了，那么就容许我在教育的领域，拾起大佬们放弃的中文，自娱自乐一下。 《悟数学》这个项目大概在2021年开始，作为自娱自乐的玩意开工。过程中有很多困难，也有很多感悟和收获。做完了初中部分，我发现，从数学的角度出发，很多关于逻辑的内容，并不适合放在数学科目里（或者说我能力有限）。但这些内容对于理性思考乃至理解更多的数学内容，又是很必要的。而以当前的语文教育方式，学生恐怕不会在语文课上系统学习这些内容。因此又激发出了关于中小学语文的教育和教学材料的一些思考。这些思考的结果是另一个项目。当然，由于能力有限，语文相关的项目还处于堆积材料的程度。\n总之，这一切只是对当前教育现状的吐槽和不切实际的狂想。请作为一个类似幻想小说的设定的东西来看待。",
    "tags": [],
    "title": "写在最初",
    "uri": "/maths/my-second-post/index.html"
  },
  {
    "breadcrumb": "从零开始学习这个世界",
    "content": "思考的起点",
    "description": "思考的起点",
    "tags": [],
    "title": "元思维",
    "uri": "/log/index.html"
  }
]
